app/views/comments/_index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 35], ["LIMIT", 1]]
---
      <%= comment.content %>
      <strong><%= comment.user.first_name + " " + comment.user.last_name %></strong>