app/views/gossips/index.html.erb

SELECT "gossips".* FROM "gossips"
---
  <div class="row row-cols-5 d-flex justify-content-center">
    <% Gossip.all.each do |gossip| %>

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 34], ["LIMIT", 1]]
---
        <div class="card-body">
          <h5 class="card-title"><%= gossip.user.first_name %></h5>