app/views/gossips/show.html.erb


<h1>Vous êtes sur le potin <br>de <%= @gossip.user.first_name %> <%= @gossip.user.last_name %></h1>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 33], ["LIMIT", 1]]