app/controllers/gossips_controller.rb

INSERT INTO "join_table_tag_gossips" ("tag_id", "gossip_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["tag_id", 25], ["gossip_id", 82], ["created_at", "2020-02-12 21:41:00.460071"], ["updated_at", "2020-02-12 21:41:00.460071"]]
---
  def update
    show
    @tag = JoinTableTagGossip.find_by(gossip_id: @gossip.id)
    if @gossip.update(title: params[:title], content: params[:content])
      if params[:tag] == "" && @tag == nil
        puts params
        render :show
      else
        @tag != nil ? @tag.update(tag_id: Tag.find(params[:tag]).id, gossip_id: @gossip.id) : JoinTableTagGossip.create(tag_id: Tag.find(params[:tag]).id, gossip_id: @gossip.id)