app/controllers/gossips_controller.rb

  def show
    @gossip = Gossip.find(params[:id])
    @comment = Comment.new
    @tags = JoinTableTagGossip.all.map{|join| join.gossip_id == @gossip.id ? join.tag.title : nil}.compact
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 79], ["LIMIT", 1]]
SELECT  "tags".* FROM "tags" WHERE "tags"."id" = $1 LIMIT $2  [["id", 30], ["LIMIT", 1]]
SELECT "join_table_tag_gossips".* FROM "join_table_tag_gossips"

  def new
    @gossip = Gossip.new
    @tag = JoinTableTagGossip.new

    @tags = Tag.all
---
SELECT "tags".* FROM "tags"

  def create
    @tags = Tag.all
    @gossip = Gossip.new(title: params[:title], content: params[:content], user_id: params[:user])

    if @gossip.save
      @tag = JoinTableTagGossip.create(tag_id: Tag.find(params[:tag]).id, gossip_id: @gossip.id)
---
SELECT "tags".* FROM "tags"
INSERT INTO "gossips" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "azertyuiop"], ["content", "âzertyuiop"], ["user_id", 33], ["created_at", "2020-02-12 20:56:27.696669"], ["updated_at", "2020-02-12 20:56:27.696669"]]
SELECT  "join_table_tag_gossips".* FROM "join_table_tag_gossips" WHERE "join_table_tag_gossips"."gossip_id" IS NULL LIMIT $1  [["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 33], ["LIMIT", 1]]
INSERT INTO "join_table_tag_gossips" ("tag_id", "gossip_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["tag_id", 28], ["gossip_id", 76], ["created_at", "2020-02-12 20:56:27.718934"], ["updated_at", "2020-02-12 20:56:27.718934"]]
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 76], ["LIMIT", 1]]

  def edit
    @tags = Tag.all
    @gossip = Gossip.find(params[:id])
---
SELECT "tags".* FROM "tags"
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 51], ["LIMIT", 1]]

  def update
    @gossip = Gossip.find(params[:id])
    if @gossip.update(title: params[:title], content: params[:content])
      @tag = JoinTableTagGossip.update(tag_id: Tag.find(params[:tag]).id, gossip_id: @gossip.id)
      @tags = JoinTableTagGossip.all.map{|join| join.gossip_id == @gossip.id ? join.tag.title : nil}.compact
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 79], ["LIMIT", 1]]
UPDATE "gossips" SET "content" = $1, "updated_at" = $2 WHERE "gossips"."id" = $3
SELECT  "join_table_tag_gossips".* FROM "join_table_tag_gossips" WHERE "join_table_tag_gossips"."gossip_id" = $1 LIMIT $2  [["gossip_id", 82], ["LIMIT", 1]]
UPDATE "join_table_tag_gossips" SET "tag_id" = $1, "gossip_id" = $2, "updated_at" = $3 WHERE "join_table_tag_gossips"."id" = $4  [["tag_id", 30], ["gossip_id", 79], ["updated_at", "2020-02-12 21:08:01.341219"], ["id", 91]]
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 51], ["LIMIT", 1]]
SELECT  "tags".* FROM "tags" WHERE "tags"."id" = $1 LIMIT $2  [["id", 30], ["LIMIT", 1]]
SELECT "join_table_tag_gossips".* FROM "join_table_tag_gossips"

  def destroy
    @gossip = Gossip.find(params[:id])
    if @gossip.destroy
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 52], ["LIMIT", 1]]
DELETE FROM "gossips" WHERE "gossips"."id" = $1  [["id", 52]]