app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 50], ["LIMIT", 1]]
---
  def show
    @current_user = User.find(params[:id])